polymurph/Atmega328_HAL/software/timer_0_development/main.c
/*
MIT License

Copyright 2019 Edwin J. Koch

Permission is hereby granted, free of charge, to any person obtaining a copy of 
this software and associated documentation files (the "Software"), to deal in 
the Software without restriction, including without limitation the rights to 
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies 
of the Software, and to permit persons to whom the Software is furnished to do 
so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all 
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE 
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER 
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, 
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE 
SOFTWARE.
*/
/*
 * main.c
 *
 * Created: 16-Jun-19 14:13:19
 * Author : Edwin J. Koch
 */ 

#define F_CPU 16000000UL
#include <avr/io.h>
#include "atmega328_hal.h"

void timer0_normal_mode()
{
	hal_timer0_enableModule();
	hal_timer0_setMode(t0_mode_NORMAL);
	hal_timer0_setClockSource(t0_clk_CLK_DIV_1024);
	hal_timer0_setOutputA(t0_outA_TOGGLE_ON_COMPARE);
	hal_timer0_setOutputB(t0_outB_TOGGLE_ON_COMPARE);
	hal_timer0_setCompareValueA(128);
	hal_timer0_setCompareValueB(64);
}

void timer0_CTC_mode()
{
	hal_timer0_enableModule();
	hal_timer0_setMode(t0_mode_CTC);
	hal_timer0_setClockSource(t0_clk_CLK_DIV_1024);
	hal_timer0_setOutputA(t0_outA_TOGGLE_ON_COMPARE);
	hal_timer0_setOutputB(t0_outB_TOGGLE_ON_COMPARE);
	hal_timer0_setCompareValueA(128);
	hal_timer0_setCompareValueB(64);
}

void timer0_fast_pwm_1_mode()
{
	hal_timer0_enableModule();
	hal_timer0_setMode(t0_mode_FAST_PWM_1);
	hal_timer0_setClockSource(t0_clk_CLK_DIV_1024);
	hal_timer0_setOutputA(t0_outA_TOGGLE_ON_COMPARE);
	hal_timer0_setOutputB(t0_outB_TOGGLE_ON_COMPARE);
	hal_timer0_setCompareValueA(128);
	hal_timer0_setCompareValueB(64);
}

void timer0_fast_pwm_2_mode()
{
	hal_timer0_enableModule();
	hal_timer0_setMode(t0_mode_FAST_PWM_2);
	hal_timer0_setClockSource(t0_clk_CLK_DIV_1024);
	hal_timer0_setOutputA(t0_outA_TOGGLE_ON_COMPARE);
	hal_timer0_setOutputB(t0_outB_TOGGLE_ON_COMPARE);
	hal_timer0_setCompareValueA(128);
	hal_timer0_setCompareValueB(64);
}

int main(void)
{
	timer0_normal_mode();
    while (1) 
    {
		
    }
}

